src/DataProcessors/СозданиеЭтаповМТК/СозданиеЭтаповМТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СозданиеЭтаповМТК</name>
  <tabularSections>
    <name>Этапы</name>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКанбана</name>
      <type>
        <types>CatalogRef.ВидыКанбанов</types>
      </type>
    </attributes>
    <attributes>
      <name>МТК</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойЭтап</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/НормыРасходов/НормыРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыРасходов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Документация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТехОперации</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаРасходов</name>
    <type>
      <types>CatalogRef.АналогиНормРасходов</types>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыЭлементовНормРасходов/ВидыЭлементовНормРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭлементовНормРасходов</name>
  <enumValues>
    <name>Деталь</name>
  </enumValues>
  <enumValues>
    <name>Документ</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>МатериалВспомогательный</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>Основа</name>
  </enumValues>
  <enumValues>
    <name>Программа</name>
  </enumValues>
  <enumValues>
    <name>ТехОперация</name>
  </enumValues>
  <enumValues>
    <name>ТехОснастка</name>
  </enumValues>
  <enumValues>
    <name>Узел</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/НормыРасходов/НормыРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НормыРасходов</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.Материалы</owners>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовНормРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Документация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТехОперации</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корневой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/СозданиеЭтаповМТК/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Создать(Команда)
Закрыть(Объект.Этапы);
КонецПроцедуры

&НаСервере
Процедура РаскрытьНаЭтапы(СписокСозданныхЭтапов,Спецификация,Количество,Уровень,флКанбан)
Основа = Справочники.НормыРасходов.ПустаяСсылка();
НР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н(Спецификация,ТекущаяДата());
	Пока НР.Следующий() Цикл
		Если НР.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Основа Тогда
		Основа = НР.Ссылка;
		НормаОсновы = НР.Норма;
		ИначеЕсли НР.ВидЭлемента <> Перечисления.ВидыЭлементовНормРасходов.Набор Тогда					
		Этап = Объект.Этапы.Добавить();
		Этап.Порядок = Этап.НомерСтроки;
		Этап.Спецификация = НР.Элемент;
		Этап.Количество = ПолучитьБазовоеКоличество(НР.Норма,НР.Элемент.ОсновнаяЕдиницаИзмерения)*Количество;
		Этап.ВидКанбана = НР.Элемент.Канбан;
            Если СписокСозданныхЭтапов.Найти(НР.Элемент) <> Неопределено Тогда
			Этап.МТК = Параметры.МТК;
			КонецЕсли;
				Если Уровень = 1 Тогда
				Этап.ОсновнойЭтап = Истина;
				КонецЕсли; 
					Если НР.Элемент.Канбан.Пустая() Тогда
					РаскрытьНаЭтапы(СписокСозданныхЭтапов,НР.Элемент,ПолучитьБазовоеКоличество(НР.Норма,НР.Элемент.ОсновнаяЕдиницаИзмерения)*Количество,Уровень+1,Не НР.Элемент.Канбан.Пустая());
					КонецЕсли; 
		Иначе
		Продолжить;
		КонецЕсли; 
	КонецЦикла;	
		Если Не Основа.Пустая() Тогда
		Нормы = РегистрыСведений.НормыРасходов.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("НормаРасходов",Основа));
		Этап = Объект.Этапы.Добавить();
		Этап.Порядок = Этап.НомерСтроки;
		Этап.Спецификация = Основа.Элемент;
		Этап.Количество = ПолучитьБазовоеКоличество(НормаОсновы,Основа.Элемент.ОсновнаяЕдиницаИзмерения)*Количество;
		Этап.ВидКанбана = Основа.Элемент.Канбан;
            Если СписокСозданныхЭтапов.Найти(Основа.Элемент) <> Неопределено Тогда
			Этап.МТК = Параметры.МТК;
			КонецЕсли;
				Если Уровень = 1 Тогда
				Этап.ОсновнойЭтап = Истина;
				КонецЕсли; 
		РаскрытьНаЭтапы(СписокСозданныхЭтапов,Основа.Элемент,ПолучитьБазовоеКоличество(НормаОсновы,Основа.Элемент.ОсновнаяЕдиницаИзмерения)*Количество,Уровень,Не Основа.Элемент.Канбан.Пустая());
		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
СписокСозданныхЭтапов = Параметры.МТК.Этапы.Выгрузить(,"ЭтапСпецификации");	
Этап = Объект.Этапы.Добавить();
Этап.Порядок = 0;
Этап.Спецификация = Параметры.МТК.Номенклатура;
Этап.Количество = Параметры.МТК.Количество;
Этап.ВидКанбана = Параметры.МТК.Номенклатура.Канбан;
    Если СписокСозданныхЭтапов.Найти(Параметры.МТК.Номенклатура) <> Неопределено Тогда
	Этап.МТК = Параметры.МТК;
	КонецЕсли;
Этап.ОсновнойЭтап = Истина;
РаскрытьНаЭтапы(СписокСозданныхЭтапов,Параметры.МТК.Номенклатура,Параметры.МТК.Количество,1,0);
Объект.Этапы.Сортировать("Порядок Убыв");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого ТЧ Из Объект.Этапы Цикл
	ТЧ.Пометка = Ложь;	
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ПометкаВыбранногоНаСервере(ТекСтрока)
ТЧ = Объект.Этапы.Получить(Объект.Этапы.Индекс(Объект.Этапы.НайтиПоИдентификатору(ТекСтрока)));
ТЧ.Пометка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПометкаВыбранных(Команда)
	Для каждого ТекСтрока из Элементы.Этапы.ВыделенныеСтроки Цикл
	ПометкаВыбранногоНаСервере(ТекСтрока);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ВыбратьАвтоматическиНаСервере()
	Для каждого ТЧ Из Объект.Этапы Цикл
		Если (ТЧ.ВидКанбана.Пустая())и(ТЧ.МТК.Пустая()) Тогда
		ТЧ.Пометка = Истина;
		Иначе
		ТЧ.Пометка = Ложь;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьАвтоматически(Команда)
ВыбратьАвтоматическиНаСервере();
КонецПроцедуры
